package testData.dataProvider;

public class InvalidAddressParameters {

    public static Object[][] provideInvalidAddressParameters() {
        return new Object[][]{

/*
  Перечень невалидных данных для поля "Адрес: куда привезти заказ":
  1. Адрес на киррилице менее 5-х символов.
  2. Максимально допустимое количество символов неизвестно.
  3. Пустое поле.
  4. Латиница.
  5. Следующие символы: _ " : ? * \ | < / > ( ) № & + = ! ; % ~ ` @ # $ ^ { } [ ] ‘
*/

                {"Орша"},
                {""}, {"ОршаL"}, {"Орша_"}, {"Орша\""},
                {"Орша:"}, {"Орша?"}, {"Орша*"}, {"Орша\\"}, {"Орша|"}, {"Орша<"}, {"Орша/"}, {"Орша>"}, {"Орша("}, {"Орша)"},
                {"Орша№"}, {"Орша&"}, {"Орша+"}, {"Орша="}, {"Орша!"}, {"Орша;"}, {"Орша%"}, {"Орша~"}, {"Орша`"},
                {"Орша@"}, {"Орша#"}, {"Орша$"}, {"Орша^"}, {"Орша{"}, {"Орша}"}, {"Орша["}, {"Орша]"}, {"Орша‘"}
        };
    }
}
